// 问题 A: 牛子爷的逃生密码
// 描述
// 反卷大队疯狂追捕牛牛子，牛子爷终于找到了真正的出口，但是出口需要密码，密码是两个整数相除的结果。
// 为了帮助牛牛子顺利逃脱，请你帮助牛子爷算出正确的密码。
//
// 格式
// 输入格式
// 多组输入，每行两个整数a、b。
//
// 输出格式
// 计算出每一行a/b的值，保留到小数点后一百位（如果小数位没有一百位，不需要补0），不需要四舍五入。
//
// 样例
// 样例输入 Copy
// 10 2
// 1 3
// 3 2
// 882391 882389
// 882391 882389
// 样例输出 Copy
// 5
// 0.3333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333
// 1.5
// 1.0000022665740393409256008404456537876152127916372484244477209031390917157852149108839752082131576889
//
#include <bits/stdc++.h>
using namespace std;
int main(void)
{
    // ifstream cin;
    // ofstream cout;
    // cin.open("test1.in");
    // cout.open("test1.out");
    int x, y;
    while (cin >> x >> y) {
        cout << x / y;
        x = (x % y) * 10;
        if (x != 0) {
            cout << ".";
            for (int i = 1; i <= 100 && x != 0; i++) {
                cout << x / y;
                x = (x % y) * 10;
            }
        }
        cout << endl;
    }
    return 0;
}