// 问题 B: 'ab' == 'ba' ?
// 描述
// 在一个全部由 'a' 和 'b' 组成的字符串，lzl 喜欢 连续的字符串'ab', wdj 喜欢连续的字符 'ba',
//  他们的师傅是一个非常公正的人，所以对于一个字符串 s, 要是里面的 'ab' 和 'ba' 出现次数相同，
// 现在有一个字符串 s, 他们的师傅可以执行如下操作：
//     1. 将 s 里面的一个字符 'a' 改成 'b';
//     2. 将 s 里面的一个字符 'b' 改成 'a';
// 进行最少次操作， 是的字符串 s 满足 'ab' = 'ba'。
// eg: 字符串s "abbb"， 'ab' 出现1次， 'ba' 出现 0 次， 你只需要一步将 最后一个 'b' 改成 'a' 即可。



// 格式
// 输入格式
// 输入一个 N, (1 <= N <= 10000) 表示有 N 个 字符串 s;
// 接下来每行 一个字符串 s. 

// 输出格式
// 第一行输出最少操作次数(可以为 0)， 第二行输出 修改后满足要求的字符串s.

// 样例
// 样例输入 Copy
// 4
// b
// aabbbabaa
// abbb
// abbaab
// 样例输出 Copy
// 0
// b
// 0
// aabbbabaa
// 1
// bbbb
// 1
// abbaaa		
// 信息
// ID		问题 B
// 提交		12  
// 解决		6
// 时间限制		1 Sec  
// 内存限制		128 MB
// 命题人		2020401290
#include<bits/stdc++.h>
using namespace std;
int main(void)
{
    
    return 0;
}